# 1. Import Library ที่จำเป็น
import matplotlib.pyplot as plt

# --- ส่วนโค้ดสำหรับรองรับภาษาไทย (เหมือนเดิม) ---
plt.rcParams['font.family'] = 'Angsana New' # หรือชื่อฟอนต์ที่ลูกใช้
plt.rcParams['font.size'] = 14
plt.rcParams['axes.unicode_minus'] = False
# ----------------------------------------

# 2. เตรียมข้อมูล (ในที่นี้คือยอดขายของสินค้าแต่ละประเภท)
ยอดขายแต่ละเดือน = ['ม.ค.', 'ก.พ.', 'มี.ค.', 'เม.ย.', 'พ.ค.', 'มิ.ย.', 'ก.ค.', 'ส.ค.', 'ก.ย.', 'ต.ค.', 'พ.ย.', 'ธ.ค.']
รายได้ต่อเดือน = [100, 120, 150, 180, 220, 250, 230, 200, 170, 140, 110, 90] # ยอดขาย (หน่วย: พันบาท)




    
#***กรณีที่อยากลองเรียงลำดับจากมากไปน้อย***
#A. เริ่มจากกับคู่ข้อมูลก่อน(zip)
data_pairs = list(zip(ยอดขายแต่ละเดือน, รายได้ต่อเดือน))
print(data_pairs) #Debug : อยากดูข้อมูลหลังจากที่มีการจับคู่ครับ

#B. เรียงข้อมูล จากน้อยไปมาก เป็นมากไปน้อย
sorted_data_pair = sorted(data_pairs, key=lambda x:x[1], reverse=True)  #sorted() คือการเรียงข้อมูล จากน้อยไปมาก
#(มี ข้อมูลdata_pair และ key=index[1](หรือก็คือรายได้ต่อเดือนที่มีการzipไว้)) 
#โดยเรากำหนดให้ เรียงจากมากไปน้อย จึงใช้ reversed = True
print(sorted_data_pair) #Debug: อยากดูข้อมูลหลังจากมีการเรียง มากไปน้อย

#C. แยกข้อมูลกลับไปเป็นแบบแรก(unzip)
sorted_ยอดขายแต่ละเดือน = [ตำแหน่ง[0] for ตำแหน่ง in sorted_data_pair] #ให้ 'ตำแหน่ง' เก็บค่า index[0] ทั้งหมดใน sorted_data_pair แล้วเก็บไว้ในตัวแปรชื่อ sorted_ยอดขายแต่ละเดือน
sorted_รายได้ต่อเดือน = [ตำแหน่ง[1] for ตำแหน่ง in sorted_data_pair] #ทำแบบด้านบน แต่เปลี่ยนเป็น index[1] 


# 3. สร้างกราฟแท่ง (plt.bar)
bars = plt.bar(sorted_ยอดขายแต่ละเดือน, sorted_รายได้ต่อเดือน, color='skyblue') # สร้างตัวแปรชื่อ bars เพื่อเก็บค่า กราฟแท่ง และ กำหนดสีแท่ง (ที่มีการเรียงจากมากไปหาน้อย)

# *** ลองเลือกเฉพาะ bar มิ.ย. แล้วเปลี่ยนสี ***
if 'มิ.ย.' in sorted_ยอดขายแต่ละเดือน:
    color_change = sorted_ยอดขายแต่ละเดือน.index('มิ.ย.')
    print(color_change) #Debugging อยากรู้ index ครับ output = 0 
    bars[color_change].set_color('red') # กำหนดตัวแปรbars indexที่0 เปลี่ยนสี แดง
    bars[color_change].set_edgecolor('black') #กำหนด bars[0] เปลี่ยน ขอบสี ดำ
    bars[color_change].set_linewidth(1.5) #กำหนด bars[0] เปลี่ยนความหน้าของเส้นสี ที่1.5


# 4. เพิ่มรายละเอียดให้กับกราฟ
plt.title('รายได้รายเดือนปี2024 (หน่วย: พันบาท)') # ชื่อกราฟ
plt.xlabel('ยอดขายแต่ละเดือน') # ป้ายกำกับแกน X
plt.ylabel('รายได้') # ป้ายกำกับแกน Y

# (ไม่บังคับ) ถ้าอยากเพิ่ม Grid Lines เหมือนเดิมก็ใส่ได้เลย
plt.grid(axis='y', linestyle='--', alpha=0.2, color='gray')

# 5. แสดงกราฟ
plt.show()